In [7]:
from pymongo import MongoClient

# Inisialisasi client dan koneksi ke database
client = MongoClient('mongodb://localhost:27017/')
db = client['company_db']
collection = db['employees']

# Contoh untuk memastikan koneksi
print('Connected to MongoDB')

Connected to MongoDB

In [13]:
# Contoh Insert Data
employee_data = {
    'name': 'Alice',
    'department': 'Finance',
    'age': 29,
    'salary': 4500
}
collection.insert_one(employee_data)
print('Data inserted')

# Tugas: Insert beberapa data tambahan, lakukan update, serta delete data

Data inserted

In [14]:
# Contoh Query Data
for employee in collection.find():
    print(employee)

{'_id': ObjectId('690a84690b9736889901b4c5'), 'name': 'Alice', 'department': 'Finance', 'age': 29, 'salary': 4500}

In [7]:
collection.update_one(
    {'name': 'Alice'},             # kondisi data yang dicari
    {'$set': {'salary': 6000}}   # field yang diubah
)
print("\n Data Alice berhasil diupdate!")

 Data Alice berhasil diupdate!

In [15]:
print(" Data setelah update:")
for employee in collection.find():
    print(employee)

 Data setelah update:
{'_id': ObjectId('690a84690b9736889901b4c5'), 'name': 'Alice', 'department': 'Finance', 'age': 29, 'salary': 4500}

In [16]:
more_employees = [
    {'name': 'Bob', 'department': 'IT', 'age': 32, 'salary': 5200},
    {'name': 'Charlie', 'department': 'HR', 'age': 27, 'salary': 4000},
    {'name': 'Diana', 'department': 'IT', 'age': 30, 'salary': 5600},
]
collection.insert_many(more_employees)
print(" Multiple data inserted")

 Multiple data inserted

In [17]:
# Contoh: Hapus karyawan yang bernama Charlie
collection.delete_one({'name': 'Charlie'})
print("\n Data Charlie berhasil dihapus!")

# Tampilkan semua data setelah delete
print(" Data setelah delete:")
for emp in collection.find():
    print(emp)

 Data Charlie berhasil dihapus!
 Data setelah delete:
{'_id': ObjectId('690a84690b9736889901b4c5'), 'name': 'Alice', 'department': 'Finance', 'age': 29, 'salary': 4500}
{'_id': ObjectId('690a84750b9736889901b4c6'), 'name': 'Bob', 'department': 'IT', 'age': 32, 'salary': 5200}
{'_id': ObjectId('690a84750b9736889901b4c8'), 'name': 'Diana', 'department': 'IT', 'age': 30, 'salary': 5600}

In [11]:
employee = collection.find_one({'name': 'Alice'})
print(employee)

{'_id': ObjectId('690331c5642b3110ccfc5d19'), 'name': 'Alice', 'department': 'Finance', 'age': 29, 'salary': 6000}

In [12]:
for emp in collection.find({'department': 'IT'}, {'_id': 0, 'name': 1, 'salary': 1}):
    print(emp)

{'name': 'Bob', 'salary': 5200}
{'name': 'Diana', 'salary': 5600}

In [13]:
jumlah_it = collection.count_documents({'department': 'IT'})
print("Jumlah karyawan IT:", jumlah_it)

Jumlah karyawan IT: 2

In [14]:
# Query Aggregation untuk mencari rata-rata gaji per departemen
pipeline = [
    {'$group': {'_id': '$department', 'average_salary': {'$avg': '$salary'}}}
]
for result in collection.aggregate(pipeline):
    print(result)

{'_id': 'Finance', 'average_salary': 6000.0}
{'_id': 'IT', 'average_salary': 5400.0}

In [18]:
from pymongo import MongoClient

# Koneksi ke MongoDB lokal
client = MongoClient('mongodb://localhost:27017/')
db = client['company_db']  # kamu bisa pakai db yang sama
products = db['products']

# Hapus data lama kalau ada (biar bersih untuk latihan)
products.delete_many({})

# Tambah minimal 10 produk
produk_list = [
    {"name": "Pensil", "category": "Alat Tulis", "price": 3000},
    {"name": "Pulpen", "category": "Alat Tulis", "price": 5000},
    {"name": "Buku Tulis", "category": "Alat Tulis", "price": 12000},
    {"name": "Penghapus", "category": "Alat Tulis", "price": 4000},
    {"name": "Tipe-X", "category": "Alat Tulis", "price": 7000},
    {"name": "Ransel", "category": "Perlengkapan", "price": 75000},
    {"name": "Tempat Pensil", "category": "Perlengkapan", "price": 25000},
    {"name": "Spidol", "category": "Alat Tulis", "price": 8000},
    {"name": "Crayon", "category": "Seni", "price": 30000},
    {"name": "Kuas", "category": "Seni", "price": 18000},
]

# Insert ke koleksi
products.insert_many(produk_list)
print(" 10 produk berhasil dimasukkan ke koleksi 'products'")

 10 produk berhasil dimasukkan ke koleksi 'products'

In [19]:
# Hitung rata-rata harga
avg_price = sum(p['price'] for p in products.find()) / products.count_documents({})
print(f" Rata-rata harga produk: {avg_price:.2f}")

# Produk dengan harga di atas rata-rata
print("\nProduk dengan harga di ATAS rata-rata:")
for p in products.find({'price': {'$gt': avg_price}}):
    print(p)

# Produk dengan harga di bawah rata-rata
print("\nProduk dengan harga di BAWAH rata-rata:")
for p in products.find({'price': {'$lt': avg_price}}):
    print(p)

 Rata-rata harga produk: 18700.00

Produk dengan harga di ATAS rata-rata:
{'_id': ObjectId('690a915d0b9736889901b4cf'), 'name': 'Ransel', 'category': 'Perlengkapan', 'price': 75000}
{'_id': ObjectId('690a915d0b9736889901b4d0'), 'name': 'Tempat Pensil', 'category': 'Perlengkapan', 'price': 25000}
{'_id': ObjectId('690a915d0b9736889901b4d2'), 'name': 'Crayon', 'category': 'Seni', 'price': 30000}

Produk dengan harga di BAWAH rata-rata:
{'_id': ObjectId('690a915d0b9736889901b4ca'), 'name': 'Pensil', 'category': 'Alat Tulis', 'price': 3000}
{'_id': ObjectId('690a915d0b9736889901b4cb'), 'name': 'Pulpen', 'category': 'Alat Tulis', 'price': 5000}
{'_id': ObjectId('690a915d0b9736889901b4cc'), 'name': 'Buku Tulis', 'category': 'Alat Tulis', 'price': 12000}
{'_id': ObjectId('690a915d0b9736889901b4cd'), 'name': 'Penghapus', 'category': 'Alat Tulis', 'price': 4000}
{'_id': ObjectId('690a915d0b9736889901b4ce'), 'name': 'Tipe-X', 'category': 'Alat Tulis', 'price': 7000}
{'_id': ObjectId('690a915d0b9736889901b4d1'), 'name': 'Spidol', 'category': 'Alat Tulis', 'price': 8000}
{'_id': ObjectId('690a915d0b9736889901b4d3'), 'name': 'Kuas', 'category': 'Seni', 'price': 18000}

In [20]:
pipeline = [
    {
        "$group": {
            "_id": "$category",          # kelompokkan berdasarkan kategori
            "total_produk": {"$sum": 1}, # hitung jumlah produk tiap kategori
            "rata_harga": {"$avg": "$price"}  # bisa juga sekalian rata-rata harga
        }
    },
    {"$sort": {"total_produk": -1}}  # urutkan dari kategori dengan produk terbanyak
]

print("\n Total produk per kategori:")
for hasil in products.aggregate(pipeline):
    print(hasil)

 Total produk per kategori:
{'_id': 'Alat Tulis', 'total_produk': 6, 'rata_harga': 6500.0}
{'_id': 'Seni', 'total_produk': 2, 'rata_harga': 24000.0}
{'_id': 'Perlengkapan', 'total_produk': 2, 'rata_harga': 50000.0}

In [21]:
from pymongo import MongoClient
import pandas as pd

# Koneksi ke MongoDB
client = MongoClient("mongodb://localhost:27017/")
db = client['company_db']
collection = db['employees']

# Kosongkan koleksi agar bersih
collection.delete_many({})

# Dataset karyawan
employees = [
    {"name": "Alice", "department": "Finance", "age": 30, "salary": 7000},
    {"name": "Bob", "department": "Finance", "age": 42, "salary": 9000},
    {"name": "Clara", "department": "Finance", "age": 25, "salary": 5800},
    {"name": "Daniel", "department": "Finance", "age": 28, "salary": 6200},
    {"name": "Eva", "department": "Finance", "age": 33, "salary": 7500},

    {"name": "Felix", "department": "HR", "age": 29, "salary": 5100},
    {"name": "Grace", "department": "HR", "age": 31, "salary": 5500},
    {"name": "Helen", "department": "HR", "age": 26, "salary": 4700},
    {"name": "Ian", "department": "HR", "age": 38, "salary": 6000},
    {"name": "Jane", "department": "HR", "age": 40, "salary": 6500},

    {"name": "Kevin", "department": "IT", "age": 27, "salary": 9500},
    {"name": "Leo", "department": "IT", "age": 35, "salary": 11000},
    {"name": "Mia", "department": "IT", "age": 32, "salary": 8700},
    {"name": "Noah", "department": "IT", "age": 24, "salary": 7200},
    {"name": "Olivia", "department": "IT", "age": 28, "salary": 9300},

    {"name": "Peter", "department": "Marketing", "age": 41, "salary": 6900},
    {"name": "Quinn", "department": "Marketing", "age": 36, "salary": 7200},
    {"name": "Ruth", "department": "Marketing", "age": 25, "salary": 5600},
    {"name": "Sam", "department": "Marketing", "age": 29, "salary": 6100},
    {"name": "Tina", "department": "Marketing", "age": 33, "salary": 6800},

    {"name": "Uma", "department": "Sales", "age": 27, "salary": 7500},
    {"name": "Victor", "department": "Sales", "age": 34, "salary": 8300},
    {"name": "Wendy", "department": "Sales", "age": 23, "salary": 4800},
    {"name": "Xander", "department": "Sales", "age": 30, "salary": 7900},
    {"name": "Yara", "department": "Sales", "age": 26, "salary": 7200},

    {"name": "Zane", "department": "Design", "age": 29, "salary": 6700},
    {"name": "Ava", "department": "Design", "age": 32, "salary": 7400},
    {"name": "Ben", "department": "Design", "age": 24, "salary": 5600},
    {"name": "Cora", "department": "Design", "age": 27, "salary": 6000},
    {"name": "Dylan", "department": "Design", "age": 35, "salary": 7800},
]

# Masukkan ke MongoDB
collection.insert_many(employees)
print(" Dataset realistis (30 karyawan) berhasil dimasukkan.")

# Tampilkan versi tabel (opsional)
pd.DataFrame(employees)

 Dataset realistis (30 karyawan) berhasil dimasukkan.

      name department  age  salary                       _id
0    Alice    Finance   30    7000  690a9a730b9736889901b4d5
1      Bob    Finance   42    9000  690a9a730b9736889901b4d6
2    Clara    Finance   25    5800  690a9a730b9736889901b4d7
3   Daniel    Finance   28    6200  690a9a730b9736889901b4d8
4      Eva    Finance   33    7500  690a9a730b9736889901b4d9
5    Felix         HR   29    5100  690a9a730b9736889901b4da
6    Grace         HR   31    5500  690a9a730b9736889901b4db
7    Helen         HR   26    4700  690a9a730b9736889901b4dc
8      Ian         HR   38    6000  690a9a730b9736889901b4dd
9     Jane         HR   40    6500  690a9a730b9736889901b4de
10   Kevin         IT   27    9500  690a9a730b9736889901b4df
11     Leo         IT   35   11000  690a9a730b9736889901b4e0
12     Mia         IT   32    8700  690a9a730b9736889901b4e1
13    Noah         IT   24    7200  690a9a730b9736889901b4e2
14  Olivia         IT   28    9300  690a9a730b9736889901b4e3
15   Peter  Marketing   41    6900  690a9a730b9736889901b4e4
16   Quinn  Marketing   36    7200  690a9a730b9736889901b4e5
17    Ruth  Marketing   25    5600  690a9a730b9736889901b4e6
18     Sam  Marketing   29    6100  690a9a730b9736889901b4e7
19    Tina  Marketing   33    6800  690a9a730b9736889901b4e8
20     Uma      Sales   27    7500  690a9a730b9736889901b4e9
21  Victor      Sales   34    8300  690a9a730b9736889901b4ea
22   Wendy      Sales   23    4800  690a9a730b9736889901b4eb
23  Xander      Sales   30    7900  690a9a730b9736889901b4ec
24    Yara      Sales   26    7200  690a9a730b9736889901b4ed
25    Zane     Design   29    6700  690a9a730b9736889901b4ee
26     Ava     Design   32    7400  690a9a730b9736889901b4ef
27     Ben     Design   24    5600  690a9a730b9736889901b4f0
28    Cora     Design   27    6000  690a9a730b9736889901b4f1
29   Dylan     Design   35    7800  690a9a730b9736889901b4f2

In [22]:
 # Cari 5 karyawan dengan gaji tertinggi dalam setiap departemen, gunakan query atau aggregation yang sesuai.
top_5 = collection.aggregate([
    {"$sort": {"department": 1, "salary": -1}},
    {"$group": {
        "_id": "$department",
        "top_5": {"$push": {"name": "$name", "salary": "$salary"}}
    }},
    {"$project": {"top_5": {"$slice": ["$top_5", 5]}}}
])

for dept in top_5:
    print(f"\nDepartemen: {dept['_id']}")
    for emp in dept["top_5"]:
        print(f"  {emp['name']} - ${emp['salary']}")

Departemen: HR
  Jane - $6500
  Ian - $6000
  Grace - $5500
  Felix - $5100
  Helen - $4700

Departemen: Design
  Dylan - $7800
  Ava - $7400
  Zane - $6700
  Cora - $6000
  Ben - $5600

Departemen: Finance
  Bob - $9000
  Eva - $7500
  Alice - $7000
  Daniel - $6200
  Clara - $5800

Departemen: Marketing
  Quinn - $7200
  Peter - $6900
  Tina - $6800
  Sam - $6100
  Ruth - $5600

Departemen: Sales
  Victor - $8300
  Xander - $7900
  Uma - $7500
  Yara - $7200
  Wendy - $4800

Departemen: IT
  Leo - $11000
  Kevin - $9500
  Olivia - $9300
  Mia - $8700
  Noah - $7200

In [23]:
#Hapus karyawan dengan usia di bawah 25 tahun
result = collection.delete_many({"age": {"$lt": 25}})
print(f" {result.deleted_count} karyawan (usia < 25) dihapus.")

 3 karyawan (usia < 25) dihapus.

In [4]:
#Laporan total gaji & rata-rata umur tiap departemen
report = collection.aggregate([
    {"$group": {
        "_id": "$department",
        "total_salary": {"$sum": "$salary"},
        "average_age": {"$avg": "$age"},
        "employee_count": {"$sum": 1}
    }}
])

print("=== Laporan Ringkas Per Departemen ===")
for r in report:
    print(f"\nDepartemen: {r['_id']}")
    print(f"  Total Gaji     : ${r['total_salary']}")
    print(f"  Rata-rata Umur : {round(r['average_age'], 1)} tahun")
    print(f"  Jumlah Karyawan: {r['employee_count']}")

=== Laporan Ringkas Per Departemen ===

Departemen: Marketing
  Total Gaji     : $32600
  Rata-rata Umur : 32.8 tahun
  Jumlah Karyawan: 5

Departemen: IT
  Total Gaji     : $38500
  Rata-rata Umur : 30.5 tahun
  Jumlah Karyawan: 4

Departemen: Finance
  Total Gaji     : $35500
  Rata-rata Umur : 31.6 tahun
  Jumlah Karyawan: 5

Departemen: HR
  Total Gaji     : $27800
  Rata-rata Umur : 32.8 tahun
  Jumlah Karyawan: 5

Departemen: Sales
  Total Gaji     : $30900
  Rata-rata Umur : 29.2 tahun
  Jumlah Karyawan: 4

Departemen: Design
  Total Gaji     : $27900
  Rata-rata Umur : 30.8 tahun
  Jumlah Karyawan: 4

In [12]:
collection.delete_many({})
print("Semua data berhasil dihapus.")

Semua data berhasil dihapus.